{
  "name": "ProxyService",
  "description": "A controller for proxying requests created for use with HttpService in Roblox.",
  "repository": "https://github.com/sentanos/ProxyService",
  "keywords": ["node", "roblox", "proxy", "httpservice", "proxyservice"],
  "env": {
    "ACCESS_KEY": {
      "description": "This is basically the password for your proxy to prevent other people from mailiciously abusing it. It is initially autogenerated but can be changed afterwards if needed.",
      "required": "true",
      "generator": "secret"
    },
    "USE_WHITELIST": {
      "description": "Enable this to only allow proxy requests to the hosts specified in ALLOWED_HOSTS below. Most users do not need to be concerned about enabling this, only do so if your server is sensitive for extra security.",
      "required": true,
      "value": "false"
    },
    "ALLOWED_HOSTS": {
      "description": "If USE_WHITELIST is true, allow only these hosts for proxy requests. Otherwise, these will be used to find the default protocol to use for the host. If it is not included in here, the protocol used will be https. The default hosts below are all Roblox hosts. This is a comma separated list of additional hosts (no spaces) with each entry in the format protocol:host.",
      "value": "roblox.com,www.roblox.com,api.roblox.com,wiki.roblox.com,assetgame.roblox.com,avatar.roblox.com,groups.roblox.com,data.roblox.com,inventory.roblox.com,search.roblox.com,auth.roblox.com,avatar.roblox.com,billing.roblox.com,chat.roblox.com,develop.roblox.com,notifications.roblox.com,games.roblox.com"
    },
    "USE_OVERRIDE_STATUS": {
      "description": "If true, requests are always returned with status code 200 but the data contains the true status code of the proxy response.",
      "required": "true",
      "value": "true"
    },
    "APPEND_HEAD": {
      "description": "If true, both the headers of the proxy response and the status code of the proxy response are returned in the response body.",
      "required": true,
      "value": "true"
    },
    "REWRITE_ACCEPT_ENCODING": {
      "description": "If true, the `Accept-Encoding` header will be set to `gzip` because deflate is not supported for APPEND_HEAD.",
      "required": true,
      "value": "true"
    },
    "GZIP_METHOD": {
      "description": "Determines how the server appends the head to gzipped data, only applied when APPEND_HEAD is true. The three allowed values are [\"transform\", \"decode\", \"append\"]. Transform will decode the proxy response on the server, append the head, and then re-encode the entire thing. Decode will decode the proxy response on the server, append the head, but will not re-encode the data (and will remove the Content-Encoding header). Append will append another gzip archive to the request, however it is not supported by all clients (Roblox does not support append).",
      "required": true,
      "value": "transform"
    }
  }
}
